# OvalDuctSizeSeparator Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..OvalDuctSizeSeparator Property
DuctSettings Class See Also
---
The oval duct size separator string.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string OvalDuctSizeSeparator { get; set; }
```

Visual Basic
---
```text
Public Property OvalDuctSizeSeparator As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ OvalDuctSizeSeparator {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace